; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	thermograph0 - mode
	image1 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation9 - direction
	Star5 - direction
	GroundStation8 - direction
	Star7 - direction
	GroundStation6 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation6)
	(supports instrument2 image1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation6)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 GroundStation9)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 thermograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 GroundStation3)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation9)
	(supports instrument5 image1)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 GroundStation8)
	(supports instrument6 thermograph0)
	(supports instrument6 image1)
	(calibration_target instrument6 Star7)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet16)
	(supports instrument7 image1)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation1)
	(calibration_target instrument7 GroundStation3)
	(calibration_target instrument7 GroundStation6)
	(supports instrument8 image1)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 GroundStation1)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet14)
)
(:goal (and
	(pointing satellite1 Planet14)
	(pointing satellite3 GroundStation3)
	(pointing satellite4 Phenomenon13)
	(have_image Planet10 image1)
	(have_image Planet11 thermograph0)
	(have_image Phenomenon12 image1)
	(have_image Phenomenon13 thermograph0)
	(have_image Planet14 image1)
	(have_image Phenomenon15 thermograph0)
	(have_image Planet16 image1)
))

)

; plan
1. (turn_to satellite4 phenomenon13 planet14)
   deleted: (pointing satellite4 planet14)
   added: (pointing satellite4 phenomenon13)
   goals met: 1 of 10
2. (turn_to satellite3 groundstation3 planet16)
   deleted: (pointing satellite3 planet16)
   added: (pointing satellite3 groundstation3)
   goals met: 2 of 10
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 10
4. (calibrate satellite1 instrument2 groundstation6)
   added: (calibrated instrument2)
   goals met: 2 of 10
5. (turn_to satellite1 phenomenon15 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 phenomenon15)
   goals met: 2 of 10
6. (take_image satellite1 phenomenon15 instrument2 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 3 of 10
7. (turn_to satellite1 phenomenon13 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 phenomenon13)
   goals met: 3 of 10
8. (take_image satellite1 phenomenon13 instrument2 thermograph0)
   added: (have_image phenomenon13 thermograph0)
   goals met: 4 of 10
9. (turn_to satellite1 phenomenon12 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon12)
   goals met: 4 of 10
10. (take_image satellite1 phenomenon12 instrument2 image1)
   added: (have_image phenomenon12 image1)
   goals met: 5 of 10
11. (turn_to satellite1 planet10 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 planet10)
   goals met: 5 of 10
12. (take_image satellite1 planet10 instrument2 image1)
   added: (have_image planet10 image1)
   goals met: 6 of 10
13. (turn_to satellite1 planet11 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet11)
   goals met: 6 of 10
14. (take_image satellite1 planet11 instrument2 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 7 of 10
15. (turn_to satellite1 planet16 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet16)
   goals met: 7 of 10
16. (take_image satellite1 planet16 instrument2 image1)
   added: (have_image planet16 image1)
   goals met: 8 of 10
17. (turn_to satellite1 planet14 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet14)
   goals met: 9 of 10
18. (take_image satellite1 planet14 instrument2 image1)
   added: (have_image planet14 image1)
   goals met: 10 of 10
